sex(Сергей Петрин, 'm').
sex(Александр Петрин, 'm').
sex(Виктор Петрин, 'm').
sex(Кирилл Петрин, 'm').
sex(Николай Толстой, 'm').
sex(Иван Долгов, 'm').
sex(Санчоус ТотСамый, 'm').
sex(Анатолий Долгов, 'm').
sex(Михаил Голев, 'm').
sex(Василий Голев, 'm').
sex(Михаил Лермонтов, 'm').
sex(Надежда Галахова,'f').
sex(Татьяна Долгова, 'f').
sex(Зинаида Иванова,'f').
sex(Лень Придумывать,'f').
sex(Надежда Галахова,'f').
sex(Кристина ТотСамый,'f').
sex(Валентина Голева,'f').
sex(Анна Петрова,'f').
sex(Нина Пушкина,'f').
sex(Александра Первая,'f').
parents(Сергей Петрин, Александр Петрин, Татьяна Долгова).
parents(Кирилл Петрин, Александр Петрин, Татьяна Долгова).
parents(Николай Толстой, Анатолий Долгов, Валентина Голева).
parents(Татьяна Долгова, Анатолий Долгов, Валентина Голева).
parents(Александр Петрин, Виктор Петрин, Надежда Галахова).
parents(Анатолий Долгов, Иван Долгов, Зинаида Иванова).
parents(Валентина Голева, Василий Голев, Нина Пушкина).
parents(Нина Пушкина, Михаил Лермонтов, Александра Первая).
parents(Василий Голев, Михаил Голев, Анна Петрова).
parents(Санчоус ТотСамый, Николай Толстой, Лень Придумывать).
parents(Кристина ТотСамый, Николай Толстой, Лень Придумывать).
