male('Александр Петрин').
male('Сергей Петрин').
male('Анатолий Долгов').
male('Виктор Петрин').
male('Иван Долгов').
male('Василий Голев').
male('Михаил Лермонтов').
male('Михаил Голев').

female('Татьяна Долгова').
female('Валентина Голева').
female('Надежда Галахова').
female('Зинаида Иванова').
female('Нина Пушкина').
female('Александра Первая').
female('Анна Петрова').

child('Сергей Петрин', 'Александр Петрин').
child('Сергей Петрин', 'Татьяна Долгова').
child('Татьяна Долгова', 'Анатолий Долгов').
child('Татьяна Долгова', 'Валентина Голева').
child('Александр Петрин', 'Виктор Петрин').
child('Александр Петрин', 'Надежда Галахова').
child('Анатолий Долгов', 'Иван Долгов').
child('Анатолий Долгов', 'Зинаида Иванова').
child('Валентина Голева', 'Василий Голев').
child('Валентина Голева', 'Нина Пушкина').
child('Нина Пушкина', 'Михаил Лермонтов').
child('Нина Пушкина', 'Александра Первая').
child('Василий Голев', 'Михаил Голев').
child('Василий Голев', 'Анна Петрова').
